# Напишите программу, в которой пользователь будет задавать две строки,
# программа -  определять количество вхождений одной строки в другой.

# in gipopotampo po out 3;
# in gipopotampo ta out 1;
# in gipopotampo fa out 0

str1 = "gipopotampo"
str2 = input("Введите строку: ")

print(str1.count(str2))
